In [1]:
import pandas as pd

df = pd.DataFrame([[1], [2]], columns = ['a'])
print(df)

   a
0  1
1  2

In [2]:
df['b'] = pd.Series([3, 4])
print(df)

   a  b
0  1  3
1  2  4

In [3]:
import pandas as pd

df = pd.DataFrame([[1, 2]], columns = ['a', 'b'])
print(df)

   a  b
0  1  2

In [4]:
df = df.append(pd.DataFrame([[3, 4]], columns = ['a', 'b']))
print(df)

   a  b
0  1  2
0  3  4

In [5]:
df = df.append(pd.DataFrame([[3, 4]], columns = ['a', 'b']))
df = df.reset_index(drop=True)
print(df)

   a  b
0  1  2
1  3  4
2  3  4

In [6]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3]], columns = ['a', 'b', 'c'])
print(df)

   a  b  c
0  1  2  3

In [7]:
del df['a']
df.pop('c')

0    3
Name: c, dtype: int64

In [8]:
import pandas as pd

df = pd.DataFrame([[1], [2]], columns = ['a'])
print(df)

   a
0  1
1  2

In [9]:
df = df.drop(1)
print(df)

   a
0  1

In [10]:
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Bob', 'Tom']
})

pd.concat([one, two])

   id  Name
0   1  Alex
1   2   Amy
0   1   Bob
1   2   Tom

In [11]:
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Bob', 'Tom']
})

pd.concat([one, two]).reset_index(drop=True)

   id  Name
0   1  Alex
1   2   Amy
2   1   Bob
3   2   Tom

In [12]:
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'id':[1, 2],
    'Score': [98, 60]
})

pd.merge(one, two, on='id')

   id  Name  Score
0   1  Alex     98
1   2   Amy     60

In [13]:
one = pd.DataFrame({
    'Name': ['Alex', 'Amy'],
})
two = pd.DataFrame({
    'Score': [98, 60]
})

one.join(two)

   Name  Score
0  Alex     98
1   Amy     60

In [15]:
df = pd.DataFrame({
  'A' : ['foo', 'bar', 'foo', 'bar'],
  'B' : ['one', 'one', 'two', 'three'],
  'C' : [1,2,3,4],
  'D' : [10, 20, 30, 40]
})
df

     A      B  C   D
0  foo    one  1  10
1  bar    one  2  20
2  foo    two  3  30
3  bar  three  4  40

In [17]:
df.groupby('A').sum()

     C   D
A
bar  6  60
foo  4  40

In [18]:
df.groupby('A').agg(sum)

     C   D
A
bar  6  60
foo  4  40

In [19]:
df.groupby(['A','B']).sum()

           C   D
A   B
bar one    2  20
    three  4  40
foo one    1  10
    two    3  30

1. 請接下列資料依照指定規則做合併：

In [21]:
import pandas as pd
import numpy as np

In [29]:
df1 = pd.DataFrame({
    'fruit': ['apple', 'banana', 'orange'] * 3,
    'weight': ['high', 'medium', 'low'] * 3,
    'price': np.random.randint(0, 15, 9)
})

df2 = pd.DataFrame({
    'fruit': ['apple', 'orange', 'pine'] * 2,
    'weight': ['high', 'low'] * 3,
    'price': np.random.randint(0, 15, 6)
})
print(df1)
print(df2)

    fruit  weight  price
0   apple    high      2
1  banana  medium      1
2  orange     low     13
3   apple    high     10
4  banana  medium      0
5  orange     low      8
6   apple    high     10
7  banana  medium      0
8  orange     low      5
    fruit weight  price
0   apple   high      1
1  orange    low      9
2    pine   high     10
3   apple    low     11
4  orange   high      0
5    pine    low      3

依照 fruit 欄位做合併

In [23]:
pd.merge( df1, df2, on='fruit' )

     fruit weight_x  price_x weight_y  price_y
0    apple     high       12     high        1
1    apple     high       12      low        0
2    apple     high        7     high        1
3    apple     high        7      low        0
4    apple     high       14     high        1
5    apple     high       14      low        0
6   orange      low       12      low        3
7   orange      low       12     high       11
8   orange      low       14      low        3
9   orange      low       14     high       11
10  orange      low        6      low        3
11  orange      low        6     high       11

依照 index 索引做合併

In [26]:
pd.merge(df1, df2, on='index')

KeyError: 'index'

2. [簡答題] 承上題，請問為什麼依照 merge 合併後有些資料不見了？

因為使用merge會合併有相同資料的欄位,因此只有出現apple和orange

3. [簡答題] 承上題，請問為什麼依照 index 合併會發生錯誤？請用程式解決

In [30]:
pd.merge(df1, df2, left_index=True, right_index=True)

  fruit_x weight_x  price_x fruit_y weight_y  price_y
0   apple     high        2   apple     high        1
1  banana   medium        1  orange      low        9
2  orange      low       13    pine     high       10
3   apple     high       10   apple      low       11
4  banana   medium        0  orange     high        0
5  orange      low        8    pine      low        3